//
//  NewsArticles.swift
//  Navigation
//
//  Created by Maksim Maiorov on 18.03.2022.
//

import Foundation

let newsArticles: [News] = [
News(author: "Компания Apple улучшит автономность в смартфонах iPhone 14",
     description: "iPhone 14 получатся более автономными, этому поспособствует не только аккумулятор, но и новые 5G модемы. Сетевой информатор написал, что новое поколение смартфонов от Apple в сравнении с текущими модификациями, станут еще более автономными. Высокого показателя специалисты добились за счет новых чипов, которые будут производиться с использованием 6-нанометрового техпроцесса TSMC.",
     image: "1",
     likes: 202,
     views: 16),
News(author: "Эксперты заявили о рекордной памяти в iPhone 14 Pro",
     description: "Самый дорогой смартфон Apple, выпущенный в 2022 году, получит восемь гигабайт оперативной памяти, сообщает издание MacRumors.Журналисты ссылаются на сообщение анонимного инсайдера, появившееся в южнокорейском блоге Naver. Блогер сообщает, что, по имеющимся сведениям, смартфоны премиальной серии iPhone 14 получат рекордный объем оперативной памяти — восемь гигабайт. Специалист ссылается на свои собственные источники в цепочке поставок iPhone.",
     image: "2",
     likes: 23,
     views: 14),
News(author: "Apple разрабатывает MacBook с гибким дисплеем",
     description: "Согласно данным аналитика Росса Янга из Display Supply Chain Consultants, Apple отложила разработку iPhone с гибким дисплеем до 2025 года. Ранее сообщалось, что Apple выпустит гибкий iPhone в 2023 или 2024 году. Точной информации о корректировке планов компании нет. Вероятно, в Apple решили не торопиться и довести гибкий iPhone до идеала.",
     image: "3",
     likes: 145,
     views: 11),
News(author: "Apple ищет новых партнёров для производства собственных 5G-модемов для iPhone 15",
     description: "Компания Apple ведёт предварительные переговоры с новыми поставщиками о тестовых заказах на первые модемные чипы 5G собственной разработки для iPhone 2023 года, сообщает издание DigiTimes. Источники утверждают, что Apple ведёт переговоры с ASE Technology, которой принадлежат Advanced Semiconductor Engineering (ASE) и Siliconware Precision Industries (SPIL), чтобы выпустить пробную партию своих первых модемов 5G для будущих iPhone.",
     image: "4",
     likes: 34,
     views: 16)
]
